// Напишите программу, которая на вход принимает число и на выход выдает его квадрат.
double num = 5;
double sqr = Math.Pow(num, 2);
Console.WriteLine(sqr);
